; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-93)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 - object)
 (:init 
    (arm-empty)
    (clear b18)
    (on b18 b4)
    (on b4 b1)
    (on b1 b27)
    (on b27 b16)
    (on b16 b23)
    (on b23 b10)
    (on-table b10)
    (clear b5)
    (on b5 b13)
    (on-table b13)
    (clear b2)
    (on b2 b20)
    (on b20 b24)
    (on b24 b14)
    (on b14 b6)
    (on b6 b12)
    (on b12 b9)
    (on b9 b26)
    (on b26 b25)
    (on b25 b11)
    (on-table b11)
    (clear b3)
    (on-table b3)
    (clear b15)
    (on b15 b22)
    (on b22 b19)
    (on b19 b21)
    (on b21 b7)
    (on b7 b8)
    (on b8 b17)
    (on-table b17))
 (:goal (and 
(on-table b3) (on-table b17) (on-table b13)
(on-table b22)
(on b7 b3)
(on b8 b7)
(on b14 b13)
(on b15 b17)
))
)

; plan
1. (unstack b15 b22)
   deleted: (on b15 b22) (clear b15) (arm-empty)
   added: (holding b15) (clear b22)
   goals met: 3 of 8
2. (stack b15 b18)
   deleted: (clear b18) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b18)
   goals met: 3 of 8
3. (unstack b22 b19)
   deleted: (on b22 b19) (clear b22) (arm-empty)
   added: (holding b22) (clear b19)
   goals met: 3 of 8
4. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 4 of 8
5. (unstack b19 b21)
   deleted: (on b19 b21) (clear b19) (arm-empty)
   added: (holding b19) (clear b21)
   goals met: 4 of 8
6. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 4 of 8
7. (unstack b21 b7)
   deleted: (on b21 b7) (clear b21) (arm-empty)
   added: (holding b21) (clear b7)
   goals met: 4 of 8
8. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 4 of 8
9. (unstack b7 b8)
   deleted: (on b7 b8) (clear b7) (arm-empty)
   added: (holding b7) (clear b8)
   goals met: 4 of 8
10. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 5 of 8
11. (unstack b8 b17)
   deleted: (on b8 b17) (clear b8) (arm-empty)
   added: (holding b8) (clear b17)
   goals met: 5 of 8
12. (stack b8 b7)
   deleted: (clear b7) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b7)
   goals met: 6 of 8
13. (unstack b15 b18)
   deleted: (on b15 b18) (clear b15) (arm-empty)
   added: (holding b15) (clear b18)
   goals met: 6 of 8
14. (stack b15 b17)
   deleted: (clear b17) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b17)
   goals met: 7 of 8
15. (unstack b2 b20)
   deleted: (on b2 b20) (clear b2) (arm-empty)
   added: (holding b2) (clear b20)
   goals met: 7 of 8
16. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 8
17. (unstack b20 b24)
   deleted: (on b20 b24) (clear b20) (arm-empty)
   added: (holding b20) (clear b24)
   goals met: 7 of 8
18. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 7 of 8
19. (unstack b24 b14)
   deleted: (on b24 b14) (clear b24) (arm-empty)
   added: (holding b24) (clear b14)
   goals met: 7 of 8
20. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 7 of 8
21. (unstack b5 b13)
   deleted: (on b5 b13) (clear b5) (arm-empty)
   added: (holding b5) (clear b13)
   goals met: 7 of 8
22. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 7 of 8
23. (unstack b14 b6)
   deleted: (on b14 b6) (clear b14) (arm-empty)
   added: (holding b14) (clear b6)
   goals met: 7 of 8
24. (stack b14 b13)
   deleted: (clear b13) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b13)
   goals met: 8 of 8
